s1 = int(input('Введите сторону 1'))
s2 = int(input('Введите сторону 2'))
s3 = int(input('Введите сторону 3'))

if s1 == s2 and s1 == s3:
    print('Можно построить равносторонний треугольник')
else:
    sum1 = s1 + s2
    sum2 = s1 + s3
    sum3 = s2 + s3

    if sum1 <= s3 or sum2 <= s2 or sum3 <= s1:
        print('Треугольник построить нельзя')
    elif s1 == s2 or s1 == s3 or s2 == s3:
        print('Можно построить равнобедренный треугольник')
    else:
        print('Можно построить разносторонний треугольник')
