# Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив надо заполнить значениями 0, 3, 4, 5
# Т.к. именно в этих позициях первого массива стоят четные числа.

import random

SIZE = 10

array = [random.randint(0, 100) for _ in range(SIZE)]
result_array = [0 for _ in range(SIZE)]

i = 0
next_insert_position = 0

while i < SIZE:
    if array[i] % 2 == 0:
        result_array[next_insert_position] = i
        next_insert_position += 1

    i += 1

i = SIZE - 1

while i >= 0:
    if result_array[i] > 0:
        break

    # Если дошли до 0-го элемента, делаем повторную проверку по исходному массиву
    # Так как не можем быть уверены, хранится ли там 0 как индекс четного элемента
    # (напр., при исходном массиве, [2, 3, 3, 3, 3, 3, 3, 3, 3, 3],
    # либо в массиве вообще не оказалось четных элементов, напр. [5, 3, 3, 3, 3, 3, 3, 3, 3, 3]
    if i > 0 or array[i] % 2 > 0:
        del result_array[i]

    i -= 1

print(f'Исходный массив: {array}')
print(f'Индексы четных элементов: {result_array}')
